app/Http/Controllers/SupportTeam/PaymentController.php

    public function selectClass(Request $request)
    {
        $this->validate($request, [
            'my_course_id' => 'required'
        ], [], [ 'my_course_id' => 'Course' ]);

        $wh['my_course_id'] = $course_id = $request->my_course_id;

        $payment1 = $this->paymentRepo->getPayment([ 'my_course_id' => $course_id, 'year' => $this->year ])->get();
        $payment2 = $this->paymentRepo->getGeneralPayment([ 'year' => $this->year ])->get();
        $payments = $payment2->count() ? $payment1->merge($payment2) : $payment1;
        $students = $this->studentRepo->getRecord($wh)->get();

        if( $payments->count() && $students->count() ) {
            foreach( $payments as $payment ) {
                foreach( $students as $student ) {
                    $paymentRecord['student_id'] = $student->user_id;
                    $paymentRecord['payment_id'] = $payment->id;
                    $paymentRecord['year'] = $this->year;
                    $receipt = $this->paymentRecordRepo->create($paymentRecord);
                    $receipt->ref_no ?: $receipt->update([ 'ref_no' => mt_rand(100000, 99999999) ]);
---
update `payment_records` set `ref_no` = 74650084, `payment_records`.`updated_at` = '2021-12-11 04:16:43' where `id` = 1