app/Http/Controllers/SupportTeam/PaymentController.php

select * from `payments` where (`year` = '2021-2022')
select * from `my_classes` where 0 = 1
---
    public function show($year)
    {
        $d['payments'] = $p = $this->pay->getPayment(['year' => $year])->get();

        if(($p->count() < 1)){
            return routeHelper::goWithDanger('payments.index');
        }

        $d['selected'] = true;
        $d['my_classes'] = $this->my_class->all();

select * from `my_classes` where 0 = 1
select * from `payments` where (`my_class_id` = '2' and `year` = '2021-2022')
select * from `payments` where `my_class_id` is null and (`year` = '2021-2022')
---
    public function select_class(Request $req)
    {
        $this->validate($req, [
            'my_class_id' => 'required|exists:my_classes,id'
        ], [], ['my_class_id' => 'Class']);

        $wh['my_class_id'] = $class_id = $req->my_class_id;

        $pay1 = $this->pay->getPayment(['my_class_id' => $class_id, 'year' => $this->year])->get();
        $pay2 = $this->pay->getGeneralPayment(['year' => $this->year])->get();