app/Http/Controllers/SupportTeam/PromotionController.php

    protected function deleteOldMarks($student_id, $year)
    {
        Mark::where(['student_id' => $student_id, 'year' => $year])->delete();
---
delete from `marks` where (`student_id` = 21 and `year` = '2022-2023')