app/Helpers/getPaymentHelper.php

select `year` from `payment_records` where (`student_id` = 21)
---
    public static function getYears($st_id)
    {
        return PaymentRecord::where(['student_id' => $st_id])->pluck('year')->unique();