app/Helpers/getSystemInfoHelper.php

select * from `settings` where `type` = 'current_session' limit 1
---
    public static function getSetting($type)
    {
        return Setting::where('type', $type)->first()->description;