app/Helpers/getUsersHelper.php

select * from `my_classes` where `my_classes`.`id` in (2)
select * from `subjects` where `teacher_id` = 55
---
    public static function findTeacherSubjects($teacher_id)
    {
        return Subject::where('teacher_id', $teacher_id)->with('my_class')->get();

select * from `student_records` where `user_id` = 54 limit 1
---
    public static function findStudentRecord($user_id)
    {
        return StudentRecord::where('user_id', $user_id)->first();