app/Helpers/printMarkSheetHelper.php

select * from `grades` where (`major_id` = 6) order by `name` asc
select * from `grades` where `major_id` is null order by `name` asc
---
    public static function getGradeList($major_id)
    {
        $grades = Grade::where(['major_id' => $major_id])->orderBy('name')->get();

        if($grades->count() < 1){
            $grades = Grade::whereNull('major_id')->orderBy('name')->get();