app/Repositories/ExamRepo.php

select * from `exams` order by `name` asc, `year` desc
---
    public function all()
    {
        return Exam::orderBy('name', 'asc')->orderBy('year', 'desc')->get();

select distinct `year` from `marks` where `student_id` = '54'
---
    public function getExamYears($student_id)
    {
        return Mark::where('student_id', $student_id)->select('year')->distinct()->get();

select * from `grades` where `grades`.`id` in (6)
---
    public function getMark($data)
    {
        return Mark::where($data)->with('grade')->get();