app/Repositories/MyClassRepo.php

    public function all()
    {
        return MyClass::orderBy('name', 'asc')->with('major')->get();
---
select * from `majors` where `majors`.`id` in (3, 4, 5, 6)
select * from `my_classes` order by `name` asc

    public function update($id, $data)
    {
        return MyClass::find($id)->update($data);
---
update `my_classes` set `name` = 'new', `my_classes`.`updated_at` = '2021-12-04 12:47:08' where `id` = 11

    public function getMajor()
    {
        return Major::orderBy('name', 'asc')->get();
---
select * from `majors` order by `name` asc

    public function getAllSections()
    {
        return Section::orderBy('name', 'asc')->with(['my_class', 'teacher'])->get();
---
select * from `my_classes` where `my_classes`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
select * from `sections` order by `name` asc

    public function getClassSections($class_id)
    {
        return Section::where(['my_class_id' => $class_id])->orderBy('name', 'asc')->get();
---
select * from `sections` where (`my_class_id` = '2') order by `name` asc

    public function getSubjectsByIDs($ids)
    {
        return Subject::whereIn('id', $ids)->orderBy('name')->get();
---
select * from `subjects` where `id` in (5, 31) order by `name` asc

    public function getAllSubjects()
    {
        return Subject::orderBy('name', 'asc')->with(['my_class', 'teacher'])->get();
---
select * from `my_classes` where `my_classes`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select * from `subjects` order by `name` asc