app/Repositories/PaymentRepo.php

select distinct `year` from `payments`
---
    public function getPaymentYears()
    {
        return Payment::select('year')->distinct()->get();

update `payment_records` set `amt_paid` = 0, `balance` = 0, `payment_records`.`updated_at` = '2021-12-04 12:28:31' where `id` = 7
---
    public function updateRecord($id, $data)
    {
        return PaymentRecord::find($id)->update($data);

delete from `receipts` where (`pr_id` = '7')
---
    public function deleteReceipts($data)
    {
        return Receipt::where($data)->delete();