app/Repositories/StudentRepo.php

    public function findStudentsByClass($class_id)
    {
        return $this->activeStudents()->where(['my_class_id' => $class_id])->with(['my_class', 'user'])->get()->sortBy('user.name');
---
select * from `my_classes` where `my_classes`.`id` in (2)
select * from `users` where `users`.`id` in (18, 19, 20, 21, 22, 23, 24)

    public function gradStudents()
    {
        return StudentRecord::where(['grad' => 1])->orderByDesc('grad_date');
---
select * from `student_records` where (`grad` = 1) order by `grad_date` desc

    public function allGradStudents()
    {
        return $this->gradStudents()->with(['my_class', 'section', 'user'])->get()->sortBy('user.name');
---
select * from `my_classes` where `my_classes`.`id` in (2)
select * from `sections` where `sections`.`id` in (1)
select * from `users` where `users`.`id` in (56)

    public function getAllDorms()
    {
        return Dorm::orderBy('name', 'asc')->get();
---
select * from `dorms` order by `name` asc

    public function deletePromotion($id)
    {
        return Promotion::destroy($id);
---
delete from `promotions` where `id` = 6

    public function getAllPromotions()
    {
        return Promotion::with(['student', 'fc', 'tc', 'fs', 'ts'])->where(['from_session' => getSystemInfoHelper::getCurrentSession(), 'to_session' => getSystemInfoHelper::getNextSession()])->get();
---
select * from `promotions` where (`from_session` = '2021-2022' and `to_session` = '2022-2023')