app/Repositories/TimeTableRepo.php

    public function getTimeTable($where)
    {
        return TimeTable::with(['subject', 'time_slot'])->orderBy('timestamp_from')->where($where)->get();
---
select * from `subjects` where `subjects`.`id` in (5)
select * from `time_slots` where `time_slots`.`id` in (1)

    protected function getDistinctTTR($remove_ttr = NULL)
    {
        return $remove_ttr ? TimeSlot::where('ttr_id', '<>', $remove_ttr)->distinct()->select('ttr_id')->pluck('ttr_id') : TimeSlot::distinct()->select('ttr_id')->pluck('ttr_id');
---
select distinct `ttr_id` from `time_slots` where `ttr_id` <> '1'

    public function getAllRecords()
    {
        return TimeTableRecord::orderBy('created_at')->with(['myCourse', 'exam'])->get();
---
select * from `exams` where `exams`.`id` in (1)
select * from `time_table_records` order by `created_at` asc