app/Repositories/UserRepo.php

update `users` set `photo` = 'https://comp1682-document.s3.ap-southeast-1.amazonaws.com/uploads/super_admin/OY8P1YFIP0/photo.jpg', `users`.`updated_at` = '2021-12-05 04:19:41' where `id` = 1
---
    public function update($id, $data)
    {
        return User::where($id)->update($data);

select * from `users` where (`user_type` = 'parent') order by `name` asc
---
    public function getUserByType($type)
    {
        return User::where(['user_type' => $type])->orderBy('name', 'asc')->get();

select * from `user_types`
---
    public function getAllTypes()
    {
        return UserType::all();

select * from `users` order by `name` asc
---
    public function getAll()
    {
        return User::orderBy('name', 'asc')->get();

select * from `users` where `user_type` <> 'student' order by `name` asc
---
    public function getPTAUsers()
    {
        return User::where('user_type', '<>', 'student')->orderBy('name', 'asc')->get();

select * from `blood_groups` order by `name` asc
---
    public function getBloodGroups()
    {
        return BloodGroup::orderBy('name')->get();